I censored some of the relevant fields with `FOO/BAR/BAZ` but this the plan then the relevant final couple of steps of the debug from applying the snippet I put in the initial issue (in case you want to reproduce or look at some of the earlier steps).
```
Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "master-instance-2"
      + name      = "my-database"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # google_sql_database_instance.master will be created
  + resource "google_sql_database_instance" "master" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_11"
      + deletion_protection           = false
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "master-instance-2"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = (known after apply)
          + authorized_gae_applications = (known after apply)
          + availability_type           = (known after apply)
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = (known after apply)
          + disk_type                   = (known after apply)
          + pricing_plan                = "PER_USE"
          + replication_type            = (known after apply)
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = (known after apply)
              + enabled                        = (known after apply)
              + location                       = (known after apply)
              + point_in_time_recovery_enabled = (known after apply)
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "https://www.googleapis.com/compute/v1/projects/FOO/global/networks/default"
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # google_sql_database_instance.replica will be created
  + resource "google_sql_database_instance" "replica" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_11"
      + deletion_protection           = false
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = "master-instance-2"
      + name                          = "replica-instance-2"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = (known after apply)
          + authorized_gae_applications = (known after apply)
          + availability_type           = (known after apply)
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = (known after apply)
          + disk_type                   = (known after apply)
          + pricing_plan                = "PER_USE"
          + replication_type            = (known after apply)
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = (known after apply)
              + enabled                        = (known after apply)
              + location                       = (known after apply)
              + point_in_time_recovery_enabled = (known after apply)
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "https://www.googleapis.com/compute/v1/projects/FOO/global/networks/default"
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
...

-----------------------------------------------------: timestamp=2021-09-20T14:10:55.901-0500
2021-09-20T14:10:55.902-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:10:55 [DEBUG] Retry Transport: Stopping retries, last request was successful: timestamp=2021-09-20T14:10:55.901-0500
2021-09-20T14:10:55.902-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:10:55 [DEBUG] Retry Transport: Returning after 1 attempts: timestamp=2021-09-20T14:10:55.901-0500
2021-09-20T14:10:55.902-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:10:55 [DEBUG] Got RUNNING while polling for operation dd724737-0192-45e5-baa3-ef272ad77778's status: timestamp=2021-09-20T14:10:55.901-0500
2021-09-20T14:10:55.902-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:10:55 [TRACE] Waiting 10s before next try: timestamp=2021-09-20T14:10:55.902-0500
google_sql_database_instance.master: Still creating... [11m11s elapsed]
2021-09-20T14:11:05.904-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Waiting for state to become: [success]: timestamp=2021-09-20T14:11:05.904-0500
2021-09-20T14:11:05.904-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Retry Transport: starting RoundTrip retry loop: timestamp=2021-09-20T14:11:05.904-0500
2021-09-20T14:11:05.904-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Retry Transport: request attempt 0: timestamp=2021-09-20T14:11:05.904-0500
2021-09-20T14:11:05.904-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Google API Request Details:
---[ REQUEST ]---------------------------------------
GET /sql/v1beta4/projects/FOO/operations/dd724737-0192-45e5-baa3-ef272ad77778?alt=json&prettyPrint=false HTTP/1.1
Host: sqladmin.googleapis.com
User-Agent: google-api-go-client/0.5 Terraform/0.15.3 (+https://www.terraform.io) Terraform-Plugin-SDK/2.5.0 terraform-provider-google/3.84.0
X-Goog-Api-Client: gl-go/1.16.2 gdcl/20210606
Accept-Encoding: gzip


-----------------------------------------------------: timestamp=2021-09-20T14:11:05.904-0500
2021-09-20T14:11:05.967-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Google API Response Details:
---[ RESPONSE ]--------------------------------------
HTTP/2.0 200 OK
Alt-Svc: h3=":443"; ma=2592000,h3-29=":443"; ma=2592000,h3-T051=":443"; ma=2592000,h3-Q050=":443"; ma=2592000,h3-Q046=":443"; ma=2592000,h3-Q043=":443"; ma=2592000,quic=":443"; ma=2592000; v="46,43"
Cache-Control: private
Content-Type: application/json; charset=UTF-8
Date: Mon, 20 Sep 2021 19:11:06 GMT
Server: ESF
Vary: Origin
Vary: X-Origin
Vary: Referer
X-Content-Type-Options: nosniff
X-Frame-Options: SAMEORIGIN
X-Xss-Protection: 0

{
 "kind": "sql#operation",
 "targetLink": "https://sqladmin.googleapis.com/sql/v1beta4/projects/FOO/instances/master-instance-2",
 "status": "DONE",
 "user": "BAR",
 "insertTime": "2021-09-20T18:59:50.997Z",
 "startTime": "2021-09-20T18:59:52.220Z",
 "endTime": "2021-09-20T19:11:04.041Z",
 "operationType": "CREATE",
 "name": "dd724737-0192-45e5-baa3-ef272ad77778",
 "targetId": "master-instance-2",
 "selfLink": "https://sqladmin.googleapis.com/sql/v1beta4/projects/FOO/operations/dd724737-0192-45e5-baa3-ef272ad77778",
 "targetProject": "FOO"
}
-----------------------------------------------------: timestamp=2021-09-20T14:11:05.967-0500
2021-09-20T14:11:05.967-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Retry Transport: Stopping retries, last request was successful: timestamp=2021-09-20T14:11:05.967-0500
2021-09-20T14:11:05.968-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Retry Transport: Returning after 1 attempts: timestamp=2021-09-20T14:11:05.967-0500
2021-09-20T14:11:05.968-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Got DONE while polling for operation dd724737-0192-45e5-baa3-ef272ad77778's status: timestamp=2021-09-20T14:11:05.967-0500
2021-09-20T14:11:05.968-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Waiting for state to become: [success]: timestamp=2021-09-20T14:11:05.967-0500
2021-09-20T14:11:05.968-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [INFO] Instantiating Google SqlAdmin client for path https://sqladmin.googleapis.com/: timestamp=2021-09-20T14:11:05.968-0500
2021-09-20T14:11:05.968-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Retry Transport: starting RoundTrip retry loop: timestamp=2021-09-20T14:11:05.968-0500
2021-09-20T14:11:05.968-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Retry Transport: request attempt 0: timestamp=2021-09-20T14:11:05.968-0500
2021-09-20T14:11:05.968-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:05 [DEBUG] Google API Request Details:
---[ REQUEST ]---------------------------------------
GET /sql/v1beta4/projects/FOO/instances/master-instance-2?alt=json&prettyPrint=false HTTP/1.1
Host: sqladmin.googleapis.com
User-Agent: google-api-go-client/0.5 Terraform/0.15.3 (+https://www.terraform.io) Terraform-Plugin-SDK/2.5.0 terraform-provider-google/3.84.0
X-Goog-Api-Client: gl-go/1.16.2 gdcl/20210606
Accept-Encoding: gzip


-----------------------------------------------------: timestamp=2021-09-20T14:11:05.968-0500
2021-09-20T14:11:06.047-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:06 [DEBUG] Google API Response Details:
---[ RESPONSE ]--------------------------------------
HTTP/2.0 200 OK
Alt-Svc: h3=":443"; ma=2592000,h3-29=":443"; ma=2592000,h3-T051=":443"; ma=2592000,h3-Q050=":443"; ma=2592000,h3-Q046=":443"; ma=2592000,h3-Q043=":443"; ma=2592000,quic=":443"; ma=2592000; v="46,43"
Cache-Control: private
Content-Type: application/json; charset=UTF-8
Date: Mon, 20 Sep 2021 19:11:06 GMT
Server: ESF
Vary: Origin
Vary: X-Origin
Vary: Referer
X-Content-Type-Options: nosniff
X-Frame-Options: SAMEORIGIN
X-Xss-Protection: 0

{
 "kind": "sql#instance",
 "state": "RUNNABLE",
 "databaseVersion": "POSTGRES_11",
 "settings": {
  "authorizedGaeApplications": [],
  "tier": "db-f1-micro",
  "kind": "sql#settings",
  "availabilityType": "ZONAL",
  "pricingPlan": "PER_USE",
  "replicationType": "SYNCHRONOUS",
  "activationPolicy": "ALWAYS",
  "ipConfiguration": {
   "privateNetwork": "projects/FOO/global/networks/default",
   "authorizedNetworks": [],
   "ipv4Enabled": false,
   "requireSsl": false
  },
  "locationPreference": {
   "zone": "us-central1-f",
   "kind": "sql#locationPreference"
  },
  "dataDiskType": "PD_SSD",
  "backupConfiguration": {
   "startTime": "02:00",
   "kind": "sql#backupConfiguration",
   "backupRetentionSettings": {
    "retentionUnit": "COUNT",
    "retainedBackups": 7
   },
   "enabled": false,
   "transactionLogRetentionDays": 7
  },
  "settingsVersion": "1",
  "storageAutoResizeLimit": "0",
  "storageAutoResize": true,
  "dataDiskSizeGb": "10"
 },
 "etag": "6187ba4503defc3bac37669888ec5a00c0e3b7edf0d744f9de3e20fbff003d75",
 "ipAddresses": [
  {
   "type": "PRIVATE",
   "ipAddress": "10.20.0.9"
  }
 ],
 "serverCaCert": {
  "kind": "sql#sslCert",
  "certSerialNumber": "0",
  "cert": "-----BEGIN CERTIFICATE-----\BAZ\n-----END CERTIFICATE-----",
  "commonName": "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=BAZ",
  "sha1Fingerprint": "BAZ",
  "instance": "master-instance-2",
  "createTime": "2021-09-20T19:00:50.780Z",
  "expirationTime": "2031-09-18T19:01:50.780Z"
 },
 "instanceType": "CLOUD_SQL_INSTANCE",
 "project": "FOO",
 "serviceAccountEmailAddress": "BAZ@gcp-sa-cloud-sql.iam.gserviceaccount.com",
 "backendType": "SECOND_GEN",
 "selfLink": "https://sqladmin.googleapis.com/sql/v1beta4/projects/FOO/instances/master-instance-2",
 "connectionName": "FOO:us-central1:master-instance-2",
 "name": "master-instance-2",
 "region": "us-central1",
 "gceZone": "us-central1-f",
 "createTime": "2021-09-20T18:59:50.180Z"
}
-----------------------------------------------------: timestamp=2021-09-20T14:11:06.046-0500
2021-09-20T14:11:06.047-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:06 [DEBUG] Retry Transport: Stopping retries, last request was successful: timestamp=2021-09-20T14:11:06.046-0500
2021-09-20T14:11:06.047-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:06 [DEBUG] Retry Transport: Returning after 1 attempts: timestamp=2021-09-20T14:11:06.046-0500
2021-09-20T14:11:06.047-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:06 [DEBUG] Waiting for state to become: [success]: timestamp=2021-09-20T14:11:06.047-0500
2021-09-20T14:11:06.047-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:06 [INFO] Instantiating Google SqlAdmin client for path https://sqladmin.googleapis.com/: timestamp=2021-09-20T14:11:06.047-0500
2021-09-20T14:11:06.048-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:06 [DEBUG] Retry Transport: starting RoundTrip retry loop: timestamp=2021-09-20T14:11:06.048-0500
2021-09-20T14:11:06.048-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:06 [DEBUG] Retry Transport: request attempt 0: timestamp=2021-09-20T14:11:06.048-0500
2021-09-20T14:11:06.048-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:06 [DEBUG] Google API Request Details:
---[ REQUEST ]---------------------------------------
GET /sql/v1beta4/projects/FOO/instances/master-instance-2/users?alt=json&prettyPrint=false HTTP/1.1
Host: sqladmin.googleapis.com
User-Agent: google-api-go-client/0.5 Terraform/0.15.3 (+https://www.terraform.io) Terraform-Plugin-SDK/2.5.0 terraform-provider-google/3.84.0
X-Goog-Api-Client: gl-go/1.16.2 gdcl/20210606
Accept-Encoding: gzip


-----------------------------------------------------: timestamp=2021-09-20T14:11:06.048-0500
google_sql_database_instance.master: Still creating... [11m21s elapsed]
2021-09-20T14:11:13.224-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:13 [DEBUG] Google API Response Details:
---[ RESPONSE ]--------------------------------------
HTTP/2.0 200 OK
Alt-Svc: h3=":443"; ma=2592000,h3-29=":443"; ma=2592000,h3-T051=":443"; ma=2592000,h3-Q050=":443"; ma=2592000,h3-Q046=":443"; ma=2592000,h3-Q043=":443"; ma=2592000,quic=":443"; ma=2592000; v="46,43"
Cache-Control: private
Content-Type: application/json; charset=UTF-8
Date: Mon, 20 Sep 2021 19:11:13 GMT
Server: ESF
Vary: Origin
Vary: X-Origin
Vary: Referer
X-Content-Type-Options: nosniff
X-Frame-Options: SAMEORIGIN
X-Xss-Protection: 0

{
 "kind": "sql#usersList",
 "items": [
  {
   "kind": "sql#user",
   "etag": "2032138c74a184e2c55ff9e7baae6314710a4de35ffb47021a5794ad80b52961",
   "name": "postgres",
   "host": "",
   "instance": "master-instance-2",
   "project": "FOO"
  }
 ]
}
-----------------------------------------------------: timestamp=2021-09-20T14:11:13.224-0500
2021-09-20T14:11:13.224-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:13 [DEBUG] Retry Transport: Stopping retries, last request was successful: timestamp=2021-09-20T14:11:13.224-0500
2021-09-20T14:11:13.224-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:13 [DEBUG] Retry Transport: Returning after 1 attempts: timestamp=2021-09-20T14:11:13.224-0500
2021-09-20T14:11:13.225-0500 [WARN]  Provider "provider[\"registry.terraform.io/hashicorp/google\"]" produced an unexpected new value for google_sql_database_instance.master, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .settings[0].collation: was null, but now cty.StringVal("")
      - .settings[0].ip_configuration[0].require_ssl: was null, but now cty.False
      - .settings[0].ip_configuration[0].private_network: was cty.StringVal("https://www.googleapis.com/compute/v1/projects/FOO/global/networks/default"), but now cty.StringVal("projects/FOO/global/networks/default")
google_sql_database_instance.master: Creation complete after 11m24s [id=master-instance-2]
google_sql_database.database: Creating...
2021-09-20T14:11:13.253-0500 [INFO]  Starting apply for google_sql_database.database
2021-09-20T14:11:13.254-0500 [DEBUG] google_sql_database.database: applying the planned Create change
2021-09-20T14:11:13.255-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:13 [DEBUG] Locking "google-sql-database-instance-FOO-master-instance-2": timestamp=2021-09-20T14:11:13.255-0500
2021-09-20T14:11:13.255-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:13 [DEBUG] Locked "google-sql-database-instance-FOO-master-instance-2": timestamp=2021-09-20T14:11:13.255-0500
2021-09-20T14:11:13.255-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:13 [DEBUG] Creating new Database: map[string]interface {}{"instance":"master-instance-2", "name":"my-database"}: timestamp=2021-09-20T14:11:13.255-0500
2021-09-20T14:11:13.255-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:13 [DEBUG] Waiting for state to become: [success]: timestamp=2021-09-20T14:11:13.255-0500
2021-09-20T14:11:13.255-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:13 [DEBUG] Retry Transport: starting RoundTrip retry loop: timestamp=2021-09-20T14:11:13.255-0500
2021-09-20T14:11:13.255-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:13 [DEBUG] Retry Transport: request attempt 0: timestamp=2021-09-20T14:11:13.255-0500
2021-09-20T14:11:13.255-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:13 [DEBUG] Google API Request Details:
---[ REQUEST ]---------------------------------------
POST /sql/v1beta4/projects/FOO/instances/master-instance-2/databases?alt=json HTTP/1.1
Host: sqladmin.googleapis.com
User-Agent: Terraform/0.15.3 (+https://www.terraform.io) Terraform-Plugin-SDK/2.5.0 terraform-provider-google/3.84.0
Content-Length: 54
Content-Type: application/json
Accept-Encoding: gzip

{
 "instance": "master-instance-2",
 "name": "my-database"
}

-----------------------------------------------------: timestamp=2021-09-20T14:11:13.255-0500
2021-09-20T14:11:13.261-0500 [WARN]  Provider "registry.terraform.io/hashicorp/google" produced an invalid plan for google_sql_database_instance.replica, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .replica_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .settings[0].pricing_plan: planned value cty.StringVal("PER_USE") for a non-computed attribute
      - .settings[0].disk_autoresize: planned value cty.True for a non-computed attribute
      - .settings[0].disk_autoresize_limit: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .settings[0].backup_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .settings[0].location_preference: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2021-09-20T14:11:17.744-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:17 [DEBUG] Google API Response Details:
---[ RESPONSE ]--------------------------------------
HTTP/2.0 200 OK
Alt-Svc: h3=":443"; ma=2592000,h3-29=":443"; ma=2592000,h3-T051=":443"; ma=2592000,h3-Q050=":443"; ma=2592000,h3-Q046=":443"; ma=2592000,h3-Q043=":443"; ma=2592000,quic=":443"; ma=2592000; v="46,43"
Cache-Control: private
Content-Type: application/json; charset=UTF-8
Date: Mon, 20 Sep 2021 19:11:17 GMT
Server: ESF
Vary: Origin
Vary: X-Origin
Vary: Referer
X-Content-Type-Options: nosniff
X-Frame-Options: SAMEORIGIN
X-Xss-Protection: 0

{
  "kind": "sql#operation",
  "targetLink": "https://sqladmin.googleapis.com/sql/v1beta4/projects/FOO/instances/master-instance-2/databases/my-database",
  "status": "DONE",
  "user": "BAR",
  "insertTime": "2021-09-20T19:11:13.471Z",
  "startTime": "2021-09-20T19:11:13.486Z",
  "endTime": "2021-09-20T19:11:17.782Z",
  "operationType": "CREATE_DATABASE",
  "name": "4134f2e8-e0a3-4b1f-9a86-1962438da87f",
  "targetId": "master-instance-2",
  "selfLink": "https://sqladmin.googleapis.com/sql/v1beta4/projects/FOO/operations/4134f2e8-e0a3-4b1f-9a86-1962438da87f",
  "targetProject": "FOO"
}

-----------------------------------------------------: timestamp=2021-09-20T14:11:17.744-0500
2021-09-20T14:11:17.744-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:17 [DEBUG] Retry Transport: Stopping retries, last request was successful: timestamp=2021-09-20T14:11:17.744-0500
2021-09-20T14:11:17.744-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:17 [DEBUG] Retry Transport: Returning after 1 attempts: timestamp=2021-09-20T14:11:17.744-0500
2021-09-20T14:11:17.744-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:17 [INFO] Instantiating Google SqlAdmin client for path https://sqladmin.googleapis.com/: timestamp=2021-09-20T14:11:17.744-0500
2021-09-20T14:11:17.744-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:17 [DEBUG] Finished creating Database "projects/FOO/instances/master-instance-2/databases/my-database": map[string]interface {}{"endTime":"2021-09-20T19:11:17.782Z", "insertTime":"2021-09-20T19:11:13.471Z", "kind":"sql#operation", "name":"4134f2e8-e0a3-4b1f-9a86-1962438da87f", "operationType":"CREATE_DATABASE", "selfLink":"https://sqladmin.googleapis.com/sql/v1beta4/projects/FOO/operations/4134f2e8-e0a3-4b1f-9a86-1962438da87f", "startTime":"2021-09-20T19:11:13.486Z", "status":"DONE", "targetId":"master-instance-2", "targetLink":"https://sqladmin.googleapis.com/sql/v1beta4/projects/FOO/instances/master-instance-2/databases/my-database", "targetProject":"FOO", "user":"BAR"}: timestamp=2021-09-20T14:11:17.744-0500
2021-09-20T14:11:17.744-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:17 [DEBUG] Waiting for state to become: [success]: timestamp=2021-09-20T14:11:17.744-0500
2021-09-20T14:11:17.744-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:17 [DEBUG] Retry Transport: starting RoundTrip retry loop: timestamp=2021-09-20T14:11:17.744-0500
2021-09-20T14:11:17.746-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:17 [DEBUG] Retry Transport: request attempt 0: timestamp=2021-09-20T14:11:17.744-0500
2021-09-20T14:11:17.746-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:17 [DEBUG] Google API Request Details:
---[ REQUEST ]---------------------------------------
GET /sql/v1beta4/projects/FOO/instances/master-instance-2/databases/my-database?alt=json HTTP/1.1
Host: sqladmin.googleapis.com
User-Agent: Terraform/0.15.3 (+https://www.terraform.io) Terraform-Plugin-SDK/2.5.0 terraform-provider-google/3.84.0
Content-Type: application/json
Accept-Encoding: gzip


-----------------------------------------------------: timestamp=2021-09-20T14:11:17.744-0500
2021-09-20T14:11:20.460-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:20 [DEBUG] Google API Response Details:
---[ RESPONSE ]--------------------------------------
HTTP/2.0 200 OK
Alt-Svc: h3=":443"; ma=2592000,h3-29=":443"; ma=2592000,h3-T051=":443"; ma=2592000,h3-Q050=":443"; ma=2592000,h3-Q046=":443"; ma=2592000,h3-Q043=":443"; ma=2592000,quic=":443"; ma=2592000; v="46,43"
Cache-Control: private
Content-Type: application/json; charset=UTF-8
Date: Mon, 20 Sep 2021 19:11:20 GMT
Server: ESF
Vary: Origin
Vary: X-Origin
Vary: Referer
X-Content-Type-Options: nosniff
X-Frame-Options: SAMEORIGIN
X-Xss-Protection: 0

{
  "kind": "sql#database",
  "charset": "UTF8",
  "collation": "en_US.UTF8",
  "etag": "229ca4394b173a23e7d69e04fc1eff974646088367085c7c49c6c29e19a83108",
  "name": "my-database",
  "instance": "master-instance-2",
  "selfLink": "https://sqladmin.googleapis.com/sql/v1beta4/projects/FOO/instances/master-instance-2/databases/my-database",
  "project": "FOO"
}

-----------------------------------------------------: timestamp=2021-09-20T14:11:20.460-0500
2021-09-20T14:11:20.461-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:20 [DEBUG] Retry Transport: Stopping retries, last request was successful: timestamp=2021-09-20T14:11:20.460-0500
2021-09-20T14:11:20.461-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:20 [DEBUG] Retry Transport: Returning after 1 attempts: timestamp=2021-09-20T14:11:20.460-0500
2021-09-20T14:11:20.461-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:20 [DEBUG] Unlocking "google-sql-database-instance-FOO-master-instance-2": timestamp=2021-09-20T14:11:20.461-0500
2021-09-20T14:11:20.461-0500 [INFO]  provider.terraform-provider-google_v3.84.0_x5: 2021/09/20 14:11:20 [DEBUG] Unlocked "google-sql-database-instance-FOO-master-instance-2": timestamp=2021-09-20T14:11:20.461-0500
google_sql_database.database: Creation complete after 7s [id=projects/FOO/instances/master-instance-2/databases/my-database]
╷
│ Error: Provider produced inconsistent final plan
│ 
│ When expanding the plan for google_sql_database_instance.replica to include
│ new values learned so far during apply, provider
│ "registry.terraform.io/hashicorp/google" produced an invalid new value for
│ .settings[0].ip_configuration[0].private_network: was
│ cty.StringVal("https://www.googleapis.com/compute/v1/projects/FOO/global/networks/default"),
│ but now
│ cty.StringVal("projects/FOO/global/networks/default").
│ 
│ This is a bug in the provider, which should be reported in the provider's own
│ issue tracker.
╵
2021-09-20T14:11:20.509-0500 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-09-20T14:11:20.512-0500 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/google/3.84.0/darwin_amd64/terraform-provider-google_v3.84.0_x5 pid=80829
2021-09-20T14:11:20.530-0500 [DEBUG] provider: plugin exited
```